# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [49]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [50]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  6  7  6  5  8
1  1  3  2  1  2
2  9  7  1  1  4
3  3  2  3  8  7
4  3  9  9  2  1

In [51]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [52]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        6        7        6        5        8
1        1        3        2        1        2
2        9        7        1        1        4
3        3        2        3        8        7
4        3        9        9        2        1

In [53]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        6        7        6        5        8
1        1        3        2        1        2
2        9        7        1        1        4
3        3        2        3        8        7
4        3        9        9        2        1

## #02: Pemilihan baris (rows selection) pada data frame

In [54]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  3  2  3  4  3
1  4  4  3  1  3
2  4  2  1  3  1
3  1  1  1  2  4
4  1  3  2  3  1
5  3  1  3  4  1
6  3  3  3  2  3
7  1  1  1  3  3
8  4  3  4  2  3
9  1  3  3  4  1

In [55]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  3  2  3  4  3
3  1  1  1  2  4
4  1  3  2  3  1
5  3  1  3  4  1
6  3  3  3  2  3
7  1  1  1  3  3
9  1  3  3  4  1

In [56]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
0  3  2  3  4  3
3  1  1  1  2  4
4  1  3  2  3  1
5  3  1  3  4  1
6  3  3  3  2  3
7  1  1  1  3  3
9  1  3  3  4  1

In [57]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
1  4  4  3  1  3
2  4  2  1  3  1
8  4  3  4  2  3

## #03: Konversi tipe data string ke numerik pada kolom data frame

In [58]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [59]:
df.dtypes

col1    object
col2    object
dtype: object

In [60]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [61]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [62]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data

In [63]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()

df['teks']=list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         12.0          8    A
1 2000-01-01 01:00:00          3.0         19    B
2 2000-01-01 02:00:00          1.0         15    C
3 2000-01-01 03:00:00         13.0         10    D
4 2000-01-01 04:00:00         14.0          6    E

In [64]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [65]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         12.0          8
1          3.0         19
2          1.0         15
3         13.0         10
4         14.0          6

In [66]:
df.select_dtypes(include='float')

   bil_pecahan
0         12.0
1          3.0
2          1.0
3         13.0
4         14.0

In [67]:
df.select_dtypes(include='int')

   bil_bulat
0          8
1         19
2         15
3         10
4          6

In [68]:
# Memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [69]:
# Memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [70]:
# Memiliih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0         12.0          8    A
1          3.0         19    B
2          1.0         15    C
3         13.0         10    D
4         14.0          6    E

## #05: Membalik urutan baris dan kolom pada data frame

In [71]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  3  8  2  3  2
1  8  7  3  6  2
2  5  8  2  1  2
3  8  9  2  4  6
4  7  3  8  1  3

In [72]:
# Membalik urutan kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  2  3  2  8  3
1  2  6  3  7  8
2  2  1  2  8  5
3  6  4  2  9  8
4  3  1  8  3  7

In [73]:
# Membalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  7  3  8  1  3
3  8  9  2  4  6
2  5  8  2  1  2
1  8  7  3  6  2
0  3  8  2  3  2

In [74]:
# Membalik urutan baris dan melakukan penyesuaian ulang index
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  7  3  8  1  3
1  8  9  2  4  6
2  5  8  2  1  2
3  8  7  3  6  2
4  3  8  2  3  2

## #06: Mengganti nama (label0 kolom pada data frame

In [75]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  5  4  7  2  6
1  7  9  5  4  1
2  3  6  6  9  7
3  1  8  5  2  7
4  1  8  7  7  4

In [76]:
# Mengganti nama (label) untuk sebuah kolom pada data frame
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  5  4     7  2  6
1  7  9     5  4  1
2  3  6     6  9  7
3  1  8     5  2  7
4  1  8     7  7  4

In [77]:
# Mengganti nama (label) untuk banyak kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     5       4  7     2  6
1     7       9  5     4  1
2     3       6  6     9  7
3     1       8  5     2  7
4     1       8  7     7  4

## #07: Menghapus missing values pada data frame (NaN)

In [78]:
# Persiapan data frame
df = pd.util.testing.makeMissingDataframe().reset_index() #formula untuk bikin dummy data dengan missing values
df.head()

        index         A         B         C         D
0  cPgOUXtILm  0.855851 -0.437928  0.433338  1.375758
1  2BGdeizY2T  0.870375       NaN  1.270809 -0.034218
2  yVIihmChaO       NaN -0.327002  0.011571  0.336100
3  mXQxJAGIW7       NaN  0.831671 -0.572486 -0.052719
4  34oqIDTO8G -0.304985  1.717827  0.308463  0.886105

In [79]:
df = df.rename(columns={'index' : 'Z'})
df.head()

            Z         A         B         C         D
0  cPgOUXtILm  0.855851 -0.437928  0.433338  1.375758
1  2BGdeizY2T  0.870375       NaN  1.270809 -0.034218
2  yVIihmChaO       NaN -0.327002  0.011571  0.336100
3  mXQxJAGIW7       NaN  0.831671 -0.572486 -0.052719
4  34oqIDTO8G -0.304985  1.717827  0.308463  0.886105

In [80]:
df_backup = df.copy(deep=True)

In [81]:
# Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z         D
0  cPgOUXtILm  1.375758
1  2BGdeizY2T -0.034218
2  yVIihmChaO  0.336100
3  mXQxJAGIW7 -0.052719
4  34oqIDTO8G  0.886105

In [82]:
# Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  cPgOUXtILm  0.855851 -0.437928  0.433338  1.375758
4  34oqIDTO8G -0.304985  1.717827  0.308463  0.886105
5  Z8amDasZEQ  0.838076  1.477777  0.030370  0.624174
6  7C6PPszlii  0.386039 -0.163397 -0.168542  1.849846
8  0oY8QJiBgj -0.723940  1.245381  0.493373  0.460115

In [83]:
# Persentase missing values untuk tiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.166667
B    0.133333
C    0.100000
D    0.000000
dtype: float64

In [84]:
# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan treshold / ambang batas (presentase missing value)
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         C         D
0  cPgOUXtILm  0.433338  1.375758
1  2BGdeizY2T  1.270809 -0.034218
2  yVIihmChaO  0.011571  0.336100
3  mXQxJAGIW7 -0.572486 -0.052719
4  34oqIDTO8G  0.308463  0.886105

## #08: Memeriksa kesamaan antar kolom (series) pada data frame

In [85]:
# Persiapan data frame
data  = {'A':[15, 15, 18, np.nan, 12],'B':[15, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [86]:
# Mengenal pandas series
# data frame merupakan kumpulan dari data series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [87]:
type(df['A'])

pandas.core.series.Series

In [88]:
type(df)

pandas.core.frame.DataFrame

In [89]:
# Memeriksa kesamaan dengan operator == (Tidak di rekomendasikan karena apabila dalam data teradap NaN maka akan tidak terbaca dengan baik)
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [90]:
# Memeriksa kesamaan dengan method equals() | Lebih di rekomendasikan
df['A'].equals(df['B'])

True

In [91]:
# Memeriksa kesamaan antar dua data frame
df1 = df.copy(deep=True)
df.equals(df1)

True

In [92]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

## #09: Membagi data frame menjadi dua secara acak

In [93]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0  13   9  16  11  18
1   4   8   7  18   2
2   9  19   9   9   2
3   8   8  14  18  18
4  17  11   1  12   3
5   6   8   3   8   3
6  17  15   8  13   3
7   2  11   4   9  11
8   7   9   3  18   9
9   5   8   4  14   8

In [94]:
# Membagi dua data frame menjadi dua secara acak berdasarkan proporsi tertentu
df.shape

(10, 5)

In [95]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 Shape: {df_1.shape}')
print(f'df_2 Shape: {df_2.shape}')

df_1 Shape: (7, 5)
df_2 Shape: (3, 5)

In [96]:
df_1

    A   B   C   D   E
3   8   8  14  18  18
6  17  15   8  13   3
9   5   8   4  14   8
4  17  11   1  12   3
7   2  11   4   9  11
1   4   8   7  18   2
0  13   9  16  11  18

In [97]:
df_2

   A   B  C   D  E
2  9  19  9   9  2
5  6   8  3   8  3
8  7   9  3  18  9